app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%3%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%3%' ESCAPE '!'
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(10), // Data dibatasi 10 record per halaman

DELETE FROM `artikel`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);